In [2]:
#ortak kolonu olduğu gibi bu sefer farklı kolonları da olan df leri bilreştirme
import pandas as pd
import numpy as np

In [3]:
dic1={"name":["ahmet","mehmet","sila","ali"],
      "sport":["running","swimming","skiing","skating"]}
dic2={"name":["ahmet","mehmet","sila","ali"],
      "surname":["ozyurt","kayahan","yilmaz","koru"]}

df1=pd.DataFrame(dic1)
df1

     name     sport
0   ahmet   running
1  mehmet  swimming
2    sila    skiing
3     ali   skating

In [4]:
df2=pd.DataFrame(dic2)
df2

     name  surname
0   ahmet   ozyurt
1  mehmet  kayahan
2    sila   yilmaz
3     ali     koru

In [6]:
dic3={"name":["ahmet","mehmet","sila","ali"],
      "calories":[100,200,150,250]}

df3=pd.DataFrame(dic3)
df3

     name  calories
0   ahmet       100
1  mehmet       200
2    sila       150
3     ali       250

In [11]:
#birbirinin aynısı olan düzene sahip df leri birleştirirken 
#pd.concat([df...],axis=0 veya 1) seklinde yapmistik
#bu sefer sadece tek kolonu aynı olanların sütunlarını birleştirirken merge kullanırız
#3 tane df aynı anda birleştirmeye calisma, 2 li 2li birleştirirsin

df1=pd.merge(df1,df2,on="name")
df1=pd.merge(df1,df3,on="name")
df1

     name     sport  surname  calories
0   ahmet   running   ozyurt       100
1  mehmet  swimming  kayahan       200
2    sila    skiing   yilmaz       150
3     ali   skating     koru       250